{
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "architectures": [
    "SurrogateTimeSeriesTransformer"
  ],
  "attention_dropout": 0.1,
  "cardinality": [
    366
  ],
  "context_length": 48,
  "d_model": 32,
  "decoder_attention_heads": 2,
  "decoder_ffn_dim": 32,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 4,
  "distribution_output": "student_t",
  "dropout": 0.1,
  "embedding_dimension": [
    2
  ],
  "encoder_attention_heads": 2,
  "encoder_ffn_dim": 32,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 4,
  "feature_size": 22,
  "init_std": 0.02,
  "input_size": 1,
  "is_encoder_decoder": true,
  "lags_sequence": [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    11,
    12,
    13,
    23,
    24,
    25,
    35,
    36,
    37
  ],
  "loss": "nll",
  "model_type": "time_series_transformer",
  "num_dynamic_real_features": 0,
  "num_parallel_samples": 100,
  "num_static_categorical_features": 1,
  "num_static_real_features": 0,
  "num_time_features": 2,
  "prediction_length": 24,
  "scaling": "mean",
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "use_cache": true
}
